src/main/java/ru/vk/itmo/test/alenkovayulya/results_stage2/wrk_get_pool_size.txt
POOL-size = 10
MacBook-Pro-Ulia:wrk2-arm yulalenk$ ./wrk -c 64 -d 20 -t 1 -L -R 50000 -s /Users/yulalenk/sem2/2024-highload-dht/src/main/java/ru/vk/itmo/test/alenkovayulya/lua/get.lua http://localhost:8080
Running 20s test @ http://localhost:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 2.384ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.27ms    1.05ms   7.85ms   67.22%
    Req/Sec    52.84k     7.10k   81.56k    67.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20ms
 75.000%    2.95ms
 90.000%    3.66ms
 99.000%    5.00ms
 99.900%    5.97ms
 99.990%    6.62ms
 99.999%    7.22ms
100.000%    7.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.034     0.000000            1         1.00
       0.935     0.100000        48449         1.11
       1.333     0.200000        96821         1.25
       1.649     0.300000       145223         1.43
       1.932     0.400000       193613         1.67
       2.203     0.500000       242074         2.00
       2.341     0.550000       266440         2.22
       2.481     0.600000       290630         2.50
       2.627     0.650000       314823         2.86
       2.781     0.700000       338789         3.33
       2.949     0.750000       363031         4.00
       3.041     0.775000       375137         4.44
       3.141     0.800000       387253         5.00
       3.249     0.825000       399301         5.71
       3.367     0.850000       411408         6.67
       3.503     0.875000       423588         8.00
       3.577     0.887500       429582         8.89
       3.659     0.900000       435634        10.00
       3.749     0.912500       441640        11.43
       3.851     0.925000       447768        13.33
       3.967     0.937500       453760        16.00
       4.031     0.943750       456769        17.78
       4.103     0.950000       459893        20.00
       4.179     0.956250       462827        22.86
       4.271     0.962500       465918        26.67
       4.375     0.968750       468945        32.00
       4.435     0.971875       470440        35.56
       4.499     0.975000       471921        40.00
       4.571     0.978125       473384        45.71
       4.659     0.981250       474928        53.33
       4.759     0.984375       476445        64.00
       4.819     0.985938       477182        71.11
       4.879     0.987500       477967        80.00
       4.947     0.989062       478704        91.43
       5.027     0.990625       479457       106.67
       5.115     0.992188       480200       128.00
       5.163     0.992969       480573       142.22
       5.223     0.993750       480962       160.00
       5.287     0.994531       481341       182.86
       5.363     0.995313       481718       213.33
       5.451     0.996094       482085       256.00
       5.499     0.996484       482276       284.44
       5.559     0.996875       482468       320.00
       5.615     0.997266       482656       365.71
       5.679     0.997656       482842       426.67
       5.751     0.998047       483035       512.00
       5.783     0.998242       483125       568.89
       5.827     0.998437       483221       640.00
       5.867     0.998633       483307       731.43
       5.919     0.998828       483401       853.33
       5.979     0.999023       483497      1024.00
       6.015     0.999121       483547      1137.78
       6.047     0.999219       483591      1280.00
       6.095     0.999316       483641      1462.86
       6.143     0.999414       483687      1706.67
       6.195     0.999512       483732      2048.00
       6.223     0.999561       483756      2275.56
       6.263     0.999609       483779      2560.00
       6.319     0.999658       483804      2925.71
       6.363     0.999707       483828      3413.33
       6.423     0.999756       483850      4096.00
       6.451     0.999780       483862      4551.11
       6.471     0.999805       483874      5120.00
       6.495     0.999829       483886      5851.43
       6.551     0.999854       483898      6826.67
       6.583     0.999878       483910      8192.00
       6.599     0.999890       483915      9102.22
       6.635     0.999902       483921     10240.00
       6.651     0.999915       483927     11702.86
       6.731     0.999927       483933     13653.33
       6.807     0.999939       483939     16384.00
       6.823     0.999945       483942     18204.44
       6.851     0.999951       483945     20480.00
       6.915     0.999957       483948     23405.71
       6.951     0.999963       483951     27306.67
       6.987     0.999969       483954     32768.00
       7.051     0.999973       483955     36408.89
       7.099     0.999976       483957     40960.00
       7.111     0.999979       483958     46811.43
       7.179     0.999982       483960     54613.33
       7.211     0.999985       483961     65536.00
       7.219     0.999986       483962     72817.78
       7.223     0.999988       483963     81920.00
       7.223     0.999989       483963     93622.86
       7.355     0.999991       483964    109226.67
       7.499     0.999992       483965    131072.00
       7.499     0.999993       483965    145635.56
       7.595     0.999994       483966    163840.00
       7.595     0.999995       483966    187245.71
       7.595     0.999995       483966    218453.33
       7.735     0.999996       483967    262144.00
       7.735     0.999997       483967    291271.11
       7.735     0.999997       483967    327680.00
       7.735     0.999997       483967    374491.43
       7.735     0.999998       483967    436906.67
       7.851     0.999998       483968    524288.00
       7.851     1.000000       483968          inf
#[Mean    =        2.267, StdDeviation   =        1.049]
#[Max     =        7.848, Total count    =       483968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  992018 requests in 20.00s, 65.28MB read
Requests/sec:  49601.15
Transfer/sec:      3.26MB


POOL-size = 20
MacBook-Pro-Ulia:wrk2-arm yulalenk$ ./wrk -c 64 -d 20 -t 1 -L -R 50000 -s /Users/yulalenk/sem2/2024-highload-dht/src/main/java/ru/vk/itmo/test/alenkovayulya/lua/get.lua http://localhost:8080
Running 20s test @ http://localhost:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 2.268ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.30ms    1.09ms   7.98ms   68.04%
    Req/Sec    52.75k     7.32k   83.33k    68.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.23ms
 75.000%    2.99ms
 90.000%    3.72ms
 99.000%    5.28ms
 99.900%    6.36ms
 99.990%    7.17ms
 99.999%    7.68ms
100.000%    7.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.031     0.000000            1         1.00
       0.921     0.100000        48438         1.11
       1.335     0.200000        96935         1.25
       1.661     0.300000       145328         1.43
       1.952     0.400000       193781         1.67
       2.227     0.500000       242088         2.00
       2.367     0.550000       266376         2.22
       2.511     0.600000       290625         2.50
       2.661     0.650000       314785         2.86
       2.819     0.700000       339050         3.33
       2.989     0.750000       363246         4.00
       3.079     0.775000       375278         4.44
       3.181     0.800000       387517         5.00
       3.289     0.825000       399509         5.71
       3.411     0.850000       411559         6.67
       3.551     0.875000       423634         8.00
       3.631     0.887500       429743         8.89
       3.717     0.900000       435811        10.00
       3.813     0.912500       441853        11.43
       3.921     0.925000       447860        13.33
       4.047     0.937500       453853        16.00
       4.123     0.943750       456926        17.78
       4.207     0.950000       459929        20.00
       4.303     0.956250       462933        22.86
       4.411     0.962500       466027        26.67
       4.539     0.968750       468994        32.00
       4.615     0.971875       470527        35.56
       4.703     0.975000       472044        40.00
       4.795     0.978125       473520        45.71
       4.899     0.981250       475044        53.33
       5.019     0.984375       476581        64.00
       5.079     0.985938       477320        71.11
       5.151     0.987500       478081        80.00
       5.231     0.989062       478828        91.43
       5.319     0.990625       479570       106.67
       5.423     0.992188       480341       128.00
       5.483     0.992969       480717       142.22
       5.547     0.993750       481095       160.00
       5.615     0.994531       481469       182.86
       5.699     0.995313       481848       213.33
       5.787     0.996094       482220       256.00
       5.839     0.996484       482404       284.44
       5.895     0.996875       482594       320.00
       5.963     0.997266       482786       365.71
       6.043     0.997656       482973       426.67
       6.127     0.998047       483167       512.00
       6.171     0.998242       483260       568.89
       6.215     0.998437       483349       640.00
       6.255     0.998633       483441       731.43
       6.311     0.998828       483540       853.33
       6.371     0.999023       483634      1024.00
       6.415     0.999121       483678      1137.78
       6.471     0.999219       483731      1280.00
       6.503     0.999316       483772      1462.86
       6.567     0.999414       483822      1706.67
       6.631     0.999512       483868      2048.00
       6.659     0.999561       483892      2275.56
       6.707     0.999609       483913      2560.00
       6.735     0.999658       483938      2925.71
       6.767     0.999707       483963      3413.33
       6.819     0.999756       483985      4096.00
       6.847     0.999780       483996      4551.11
       6.891     0.999805       484009      5120.00
       6.927     0.999829       484020      5851.43
       7.003     0.999854       484032      6826.67
       7.091     0.999878       484043      8192.00
       7.155     0.999890       484050      9102.22
       7.167     0.999902       484056     10240.00
       7.203     0.999915       484061     11702.86
       7.231     0.999927       484067     13653.33
       7.267     0.999939       484074     16384.00
       7.339     0.999945       484076     18204.44
       7.459     0.999951       484079     20480.00
       7.467     0.999957       484082     23405.71
       7.527     0.999963       484085     27306.67
       7.571     0.999969       484088     32768.00
       7.575     0.999973       484089     36408.89
       7.611     0.999976       484091     40960.00
       7.627     0.999979       484092     46811.43
       7.635     0.999982       484094     54613.33
       7.663     0.999985       484095     65536.00
       7.679     0.999986       484097     72817.78
       7.679     0.999988       484097     81920.00
       7.679     0.999989       484097     93622.86
       7.703     0.999991       484098    109226.67
       7.923     0.999992       484099    131072.00
       7.923     0.999993       484099    145635.56
       7.931     0.999994       484100    163840.00
       7.931     0.999995       484100    187245.71
       7.931     0.999995       484100    218453.33
       7.971     0.999996       484101    262144.00
       7.971     0.999997       484101    291271.11
       7.971     0.999997       484101    327680.00
       7.971     0.999997       484101    374491.43
       7.971     0.999998       484101    436906.67
       7.983     0.999998       484102    524288.00
       7.983     1.000000       484102          inf
#[Mean    =        2.299, StdDeviation   =        1.091]
#[Max     =        7.980, Total count    =       484102]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  992059 requests in 20.00s, 65.28MB read
Requests/sec:  49602.79
Transfer/sec:      3.26MB

POOL-size = 30
MacBook-Pro-Ulia:wrk2-arm yulalenk$ ./wrk -c 64 -d 20 -t 1 -L -R 50000 -s /Users/yulalenk/sem2/2024-highload-dht/src/main/java/ru/vk/itmo/test/alenkovayulya/lua/get.lua http://localhost:8080
Running 20s test @ http://localhost:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 2.257ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19ms    1.04ms   7.61ms   67.39%
    Req/Sec    52.71k     7.15k   77.78k    69.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.12ms
 75.000%    2.85ms
 90.000%    3.56ms
 99.000%    4.88ms
 99.900%    5.78ms
 99.990%    6.48ms
 99.999%    7.17ms
100.000%    7.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.022     0.000000            1         1.00
       0.862     0.100000        48510         1.11
       1.263     0.200000        96896         1.25
       1.577     0.300000       145251         1.43
       1.859     0.400000       193762         1.67
       2.125     0.500000       242115         2.00
       2.259     0.550000       266449         2.22
       2.393     0.600000       290549         2.50
       2.535     0.650000       314869         2.86
       2.685     0.700000       339117         3.33
       2.849     0.750000       363150         4.00
       2.939     0.775000       375299         4.44
       3.037     0.800000       387493         5.00
       3.141     0.825000       399421         5.71
       3.261     0.850000       411565         6.67
       3.397     0.875000       423610         8.00
       3.475     0.887500       429762         8.89
       3.561     0.900000       435828        10.00
       3.653     0.912500       441802        11.43
       3.757     0.925000       447838        13.33
       3.879     0.937500       453941        16.00
       3.947     0.943750       456912        17.78
       4.019     0.950000       459925        20.00
       4.103     0.956250       462979        22.86
       4.199     0.962500       466072        26.67
       4.307     0.968750       469072        32.00
       4.363     0.971875       470544        35.56
       4.427     0.975000       472043        40.00
       4.499     0.978125       473553        45.71
       4.579     0.981250       475070        53.33
       4.675     0.984375       476594        64.00
       4.727     0.985938       477356        71.11
       4.779     0.987500       478080        80.00
       4.839     0.989062       478841        91.43
       4.915     0.990625       479627       106.67
       4.995     0.992188       480353       128.00
       5.039     0.992969       480729       142.22
       5.091     0.993750       481112       160.00
       5.147     0.994531       481495       182.86
       5.211     0.995313       481862       213.33
       5.295     0.996094       482259       256.00
       5.335     0.996484       482430       284.44
       5.375     0.996875       482626       320.00
       5.427     0.997266       482820       365.71
       5.483     0.997656       483003       426.67
       5.547     0.998047       483187       512.00
       5.591     0.998242       483276       568.89
       5.631     0.998437       483370       640.00
       5.679     0.998633       483469       731.43
       5.723     0.998828       483558       853.33
       5.787     0.999023       483656      1024.00
       5.827     0.999121       483704      1137.78
       5.867     0.999219       483752      1280.00
       5.911     0.999316       483798      1462.86
       5.955     0.999414       483843      1706.67
       6.019     0.999512       483892      2048.00
       6.051     0.999561       483915      2275.56
       6.083     0.999609       483938      2560.00
       6.119     0.999658       483961      2925.71
       6.171     0.999707       483984      3413.33
       6.227     0.999756       484008      4096.00
       6.259     0.999780       484019      4551.11
       6.303     0.999805       484031      5120.00
       6.351     0.999829       484044      5851.43
       6.379     0.999854       484055      6826.67
       6.415     0.999878       484066      8192.00
       6.459     0.999890       484073      9102.22
       6.487     0.999902       484081     10240.00
       6.507     0.999915       484084     11702.86
       6.575     0.999927       484090     13653.33
       6.619     0.999939       484097     16384.00
       6.699     0.999945       484099     18204.44
       6.707     0.999951       484102     20480.00
       6.779     0.999957       484105     23405.71
       6.831     0.999963       484108     27306.67
       6.871     0.999969       484111     32768.00
       6.883     0.999973       484112     36408.89
       6.947     0.999976       484114     40960.00
       7.047     0.999979       484116     46811.43
       7.087     0.999982       484117     54613.33
       7.099     0.999985       484118     65536.00
       7.175     0.999986       484120     72817.78
       7.175     0.999988       484120     81920.00
       7.175     0.999989       484120     93622.86
       7.219     0.999991       484121    109226.67
       7.247     0.999992       484122    131072.00
       7.247     0.999993       484122    145635.56
       7.323     0.999994       484123    163840.00
       7.323     0.999995       484123    187245.71
       7.323     0.999995       484123    218453.33
       7.455     0.999996       484124    262144.00
       7.455     0.999997       484124    291271.11
       7.455     0.999997       484124    327680.00
       7.455     0.999997       484124    374491.43
       7.455     0.999998       484124    436906.67
       7.611     0.999998       484125    524288.00
       7.611     1.000000       484125          inf
#[Mean    =        2.186, StdDeviation   =        1.035]
#[Max     =        7.608, Total count    =       484125]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  992160 requests in 20.00s, 65.29MB read
Requests/sec:  49606.21
Transfer/sec:      3.26MB

MacBook-Pro-Ulia:wrk2-arm yulalenk$ ./wrk -c 64 -d 20 -t 1 -L -R 50000 -s /Users/yulalenk/sem2/2024-highload-dht/src/main/java/ru/vk/itmo/test/alenkovayulya/lua/get.lua http://localhost:8080
Running 20s test @ http://localhost:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 2.179ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.08ms   9.56ms   69.71%
    Req/Sec    52.75k     7.45k   84.00k    67.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.10ms
 75.000%    2.83ms
 90.000%    3.51ms
 99.000%    5.43ms
 99.900%    7.57ms
 99.990%    8.86ms
 99.999%    9.40ms
100.000%    9.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            1         1.00
       0.848     0.100000        48459         1.11
       1.234     0.200000        96859         1.25
       1.550     0.300000       145301         1.43
       1.829     0.400000       193754         1.67
       2.095     0.500000       242025         2.00
       2.231     0.550000       266295         2.22
       2.371     0.600000       290656         2.50
       2.515     0.650000       314917         2.86
       2.663     0.700000       338918         3.33
       2.825     0.750000       363135         4.00
       2.913     0.775000       375213         4.44
       3.009     0.800000       387473         5.00
       3.111     0.825000       399423         5.71
       3.225     0.850000       411554         6.67
       3.353     0.875000       423610         8.00
       3.427     0.887500       429685         8.89
       3.511     0.900000       435745        10.00
       3.603     0.912500       441733        11.43
       3.709     0.925000       447773        13.33
       3.835     0.937500       453819        16.00
       3.909     0.943750       456832        17.78
       3.993     0.950000       459864        20.00
       4.091     0.956250       462885        22.86
       4.207     0.962500       465947        26.67
       4.355     0.968750       468961        32.00
       4.443     0.971875       470435        35.56
       4.547     0.975000       471945        40.00
       4.663     0.978125       473478        45.71
       4.803     0.981250       474981        53.33
       4.975     0.984375       476480        64.00
       5.083     0.985938       477239        71.11
       5.211     0.987500       478006        80.00
       5.347     0.989062       478757        91.43
       5.499     0.990625       479518       106.67
       5.679     0.992188       480272       128.00
       5.779     0.992969       480643       142.22
       5.899     0.993750       481024       160.00
       6.035     0.994531       481394       182.86
       6.207     0.995313       481774       213.33
       6.375     0.996094       482150       256.00
       6.471     0.996484       482343       284.44
       6.555     0.996875       482534       320.00
       6.659     0.997266       482721       365.71
       6.771     0.997656       482908       426.67
       6.935     0.998047       483098       512.00
       7.035     0.998242       483190       568.89
       7.155     0.998437       483285       640.00
       7.287     0.998633       483380       731.43
       7.411     0.998828       483474       853.33
       7.611     0.999023       483568      1024.00
       7.715     0.999121       483615      1137.78
       7.843     0.999219       483663      1280.00
       7.955     0.999316       483710      1462.86
       8.067     0.999414       483758      1706.67
       8.175     0.999512       483804      2048.00
       8.255     0.999561       483831      2275.56
       8.311     0.999609       483854      2560.00
       8.383     0.999658       483878      2925.71
       8.447     0.999707       483902      3413.33
       8.559     0.999756       483925      4096.00
       8.599     0.999780       483936      4551.11
       8.631     0.999805       483947      5120.00
       8.687     0.999829       483958      5851.43
       8.743     0.999854       483971      6826.67
       8.783     0.999878       483981      8192.00
       8.831     0.999890       483988      9102.22
       8.863     0.999902       483993     10240.00
       8.919     0.999915       483999     11702.86
       8.967     0.999927       484007     13653.33
       9.015     0.999939       484012     16384.00
       9.031     0.999945       484014     18204.44
       9.119     0.999951       484017     20480.00
       9.151     0.999957       484020     23405.71
       9.175     0.999963       484024     27306.67
       9.183     0.999969       484026     32768.00
       9.223     0.999973       484027     36408.89
       9.295     0.999976       484029     40960.00
       9.335     0.999979       484031     46811.43
       9.343     0.999982       484032     54613.33
       9.351     0.999985       484033     65536.00
       9.391     0.999986       484034     72817.78
       9.399     0.999988       484035     81920.00
       9.399     0.999989       484035     93622.86
       9.407     0.999991       484036    109226.67
       9.431     0.999992       484037    131072.00
       9.431     0.999993       484037    145635.56
       9.471     0.999994       484038    163840.00
       9.471     0.999995       484038    187245.71
       9.471     0.999995       484038    218453.33
       9.551     0.999996       484039    262144.00
       9.551     0.999997       484039    291271.11
       9.551     0.999997       484039    327680.00
       9.551     0.999997       484039    374491.43
       9.551     0.999998       484039    436906.67
       9.567     0.999998       484040    524288.00
       9.567     1.000000       484040          inf
#[Mean    =        2.176, StdDeviation   =        1.085]
#[Max     =        9.560, Total count    =       484040]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  992108 requests in 20.00s, 65.28MB read
Requests/sec:  49604.98
Transfer/sec:      3.26MB